# FailureDefinitionId Methods

---
The FailureDefinitionId type exposes the following members.
| Name| Description
---|---|---
| Equals|  Compares two Guid-based enum object based on their concrete class and GUID value. (Inherited from GuidEnum)
| GetHashCode|  Generates a hash code for this Guid-based enum object. (Inherited from GuidEnum)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
FailureDefinitionId Class
Autodesk.Revit.DB Namespace